final List<Map<String, String>> trendingNews = [
  {
    'title': '5 ข้อ ทีมชาติไทยเฉือนศรีลังกา',
    'seond': 'คิดถึง ธีรศิลป์! บทสรุป 5 ข้อ ทีมชาติไทยเฉือนศรีลังกาคัดเอเชียนคัพ',
    'refer': 'ผู้เขียน siamsport',
    'content1': '1. วางผังถูกใจ ไม่ฝืนใช้แบ็กซ้ายที่ถนัดเท้าขวา',
    'content2': 'มาซาทาดะ อิชิอิ ใช้ผู้เล่นชุดที่ดีที่สุดสำหรับเกมประเดิมสนาม เอเชียน คัพ 2027 ด้วยการใช้ ปฏิวัติ คำไหม ลงเฝ้าเสาตั้งแต่นาทีแรก ส่วนแนวรับ เอเลียส ดอเลาะ กลับมาประจำการคู่กับ โจนาธาร เข็มดี ที่ฟอร์มพวยพุ่งขึ้นเรื่อยๆ แบ็กขวา นิโคลัส มิคเมลสัน จองสัมปทานอีกยาว ทว่าที่น่าสนใจคือการให้ อิรฟาน ดอเลาะ ได้โอกาสลงเล่นต่อเนื่อง นี่คือการตัดสินใจที่ยอดเยี่ยม เพราะเขาคือนักเตะที่ถนัดเท้าซ้ายโดยธรรมชาติ แม้ตำแหน่งถนัดจะเป็นกองกลางก็ตาม แต่อย่างน้อยหมอนี่ก็เคยถูกถ่างออกไปยืนเป็นฟูลแบ็กมาแล้วในหลายๆ ครั้ง ทั้งในทีมชาติรุ่นอายุไม่เกิน 23 ปี หรือระดับสโมสร ผลที่ออกมาถือว่าอยู่ในเกณฑ์บวก แม้จะไม่เด่นเท่ากับแบ็กซ้ายตามธรรมชาติ ทว่า อิรฟาน ก็ทำหน้าที่ที่ได้รับมอบหมายได้ดีเยี่ยม ซึ่งเมื่อเทียบกับการเอานักเตะที่ถนัดเท้าขวามายืน น่าจะดูฝืนๆ และอาจจะทำให้เกมไม่ไหลลื่นก็เป็นได้ อย่างไรก็ตาม โดยรวมถือว่า อิชิอิ ไม่ฝืนเรื่องการใช้ผู้เล่นจนเกินไปเหมือนที่ผ่านๆ มา',
    'content3': '2. ศรีลังกา ไม่หมู',
    'content4': 'แม้ว่า ฟีฟ่า แรงกิ้ง ของศรีลังกา จะอยู่ไกลโพ้นจากไทย เพราะปัจจุบันพวกเขารั้งอันดับที่ 45 จาก 46 ชาติของเอเชีย ซึ่งอยู่ห่างกับช้างศึกเอามากๆ ทว่าการที่ทีมกองทัพทองยุคปรับปรุงใหม่ หันมาใช้บริการนักเตะลูกครึ่งเป็นแกนหลัก มันจึงทำให้พวกเขาแข็งแกร่งขึ้นอย่างชัดเจน 11 ผู้เล่นชุดแรกในการบุก ราชมังคลากีฬาสถาน ปรากฏว่าไม่มีคนใดเล่นในประเทศตนเองเลยสักราย หนำซ้ำยังค้าแข้งในลีกยุโรป มากถึง 7 คน เท่านั้นไม่พอ ตัวจริงของศรีลังกา นั้นเป็นนักเตะ ลูกครึ่ง ไปแล้ว 8 คน โดยที่อีก 2 รายอย่าง อนุจัน ราเจนดรัม (แบ็กซ้าย) กับ อัดหะวัน ราจาโมหัน (กองกลาง) นั้นเกิดที่นอร์เวย์ และสวีเดน ตามลำดับ ดังนั้นจึงมีเพียง สุจัน เปเรรา เพียงคนเดียวเท่านั้นที่เป็นคนท้องถิ่นพื้นเมือง ด้วยเหตุนี้เอง ทีมกองทัพทองจึงแข็งแกร่งขึ้นกว่าเก่าก่อนมากมาย ยิ่งได้ อับดุลเลาะห์ อัล มูตารี่ กุนซือชาวคูเวต ผู้ผ่านงานโค้ชมากโชกโชนมาวางแท็กติก มันจึงทำให้พวกเชาเล่นฟุตบอลอย่างมีระบบระเบียบแบบที่ทำให้ทุกคนต้องประหลาดใจ ตัวอย่างชัดเจนคือเกมในครึ่งแรกที่ศรีลังกา มีช่วงเวลาเพรสซิ่งสูงจนไทย ไม่อาจต่อบอลได้เลย แถมยังเปิดโอกาสให้ทีมช้างศึกได้ยิงเพียง 2 หน โดยหนึ่งในนั้นคือความผิดพลาดเพียงหนเดียวอันนำมาซึ่งประตูโทนของการแข่งขันนั่นเอง ต่อจากนี้ไป รับประกันเลยว่าทีมกองทัพทองจะไม่ใช่หมูในอวยอีกต่อไป',
    'image': 'assets/images/image1.webp',
  },
  {
    'title': 'เทรนต์ อาร์โนลด์ ลงตรงไหน?',
    'seond': 'เทรนต์ อาร์โนลด์ ลงตรงไหน? ไลน์อัพ เรอัล มาดริด ซีซั่น2025/26',
    'refer': 'ผู้เขียน siamsport',
    'image': 'assets/images/image.png',
  },
  
  {
    'title': 'ลิเวอร์พูล! ยุคเปลี่ยนคู่แบ็ก',
    'seond': 'ส่องไลน์อัพใหม่ลิเวอร์พูล! ยุคเปลี่ยนคู่แบ็ก "เคอร์เคซ-ฟริมปง" เติมโหดสองฝั่ง',
    'refer': 'ผู้เขียน siamsport',
    'image': 'assets/images/image2.webp',
  },
];

// final List<Map<String, String>> premierleagueNews2 = [
//   {
//     'title': '5 ข้อ ทีมชาติไทยเฉือนศรีลังกา',
//     'seond': 'คิดถึง ธีรศิลป์! บทสรุป 5 ข้อ ทีมชาติไทยเฉือนศรีลังกาคัดเอเชียนคัพ',
//     'refer': 'ผู้เขียน siamsport',
//     'content1': '1. วางผังถูกใจ ไม่ฝืนใช้แบ็กซ้ายที่ถนัดเท้าขวา',
//     'content2': 'มาซาทาดะ อิชิอิ ใช้ผู้เล่นชุดที่ดีที่สุดสำหรับเกมประเดิมสนาม เอเชียน คัพ 2027 ด้วยการใช้ ปฏิวัติ คำไหม ลงเฝ้าเสาตั้งแต่นาทีแรก ส่วนแนวรับ เอเลียส ดอเลาะ กลับมาประจำการคู่กับ โจนาธาร เข็มดี ที่ฟอร์มพวยพุ่งขึ้นเรื่อยๆ แบ็กขวา นิโคลัส มิคเมลสัน จองสัมปทานอีกยาว ทว่าที่น่าสนใจคือการให้ อิรฟาน ดอเลาะ ได้โอกาสลงเล่นต่อเนื่อง นี่คือการตัดสินใจที่ยอดเยี่ยม เพราะเขาคือนักเตะที่ถนัดเท้าซ้ายโดยธรรมชาติ แม้ตำแหน่งถนัดจะเป็นกองกลางก็ตาม แต่อย่างน้อยหมอนี่ก็เคยถูกถ่างออกไปยืนเป็นฟูลแบ็กมาแล้วในหลายๆ ครั้ง ทั้งในทีมชาติรุ่นอายุไม่เกิน 23 ปี หรือระดับสโมสร ผลที่ออกมาถือว่าอยู่ในเกณฑ์บวก แม้จะไม่เด่นเท่ากับแบ็กซ้ายตามธรรมชาติ ทว่า อิรฟาน ก็ทำหน้าที่ที่ได้รับมอบหมายได้ดีเยี่ยม ซึ่งเมื่อเทียบกับการเอานักเตะที่ถนัดเท้าขวามายืน น่าจะดูฝืนๆ และอาจจะทำให้เกมไม่ไหลลื่นก็เป็นได้ อย่างไรก็ตาม โดยรวมถือว่า อิชิอิ ไม่ฝืนเรื่องการใช้ผู้เล่นจนเกินไปเหมือนที่ผ่านๆ มา',
//     'content3': '2. ศรีลังกา ไม่หมู',
//     'content4': 'แม้ว่า ฟีฟ่า แรงกิ้ง ของศรีลังกา จะอยู่ไกลโพ้นจากไทย เพราะปัจจุบันพวกเขารั้งอันดับที่ 45 จาก 46 ชาติของเอเชีย ซึ่งอยู่ห่างกับช้างศึกเอามากๆ ทว่าการที่ทีมกองทัพทองยุคปรับปรุงใหม่ หันมาใช้บริการนักเตะลูกครึ่งเป็นแกนหลัก มันจึงทำให้พวกเขาแข็งแกร่งขึ้นอย่างชัดเจน 11 ผู้เล่นชุดแรกในการบุก ราชมังคลากีฬาสถาน ปรากฏว่าไม่มีคนใดเล่นในประเทศตนเองเลยสักราย หนำซ้ำยังค้าแข้งในลีกยุโรป มากถึง 7 คน เท่านั้นไม่พอ ตัวจริงของศรีลังกา นั้นเป็นนักเตะ ลูกครึ่ง ไปแล้ว 8 คน โดยที่อีก 2 รายอย่าง อนุจัน ราเจนดรัม (แบ็กซ้าย) กับ อัดหะวัน ราจาโมหัน (กองกลาง) นั้นเกิดที่นอร์เวย์ และสวีเดน ตามลำดับ ดังนั้นจึงมีเพียง สุจัน เปเรรา เพียงคนเดียวเท่านั้นที่เป็นคนท้องถิ่นพื้นเมือง ด้วยเหตุนี้เอง ทีมกองทัพทองจึงแข็งแกร่งขึ้นกว่าเก่าก่อนมากมาย ยิ่งได้ อับดุลเลาะห์ อัล มูตารี่ กุนซือชาวคูเวต ผู้ผ่านงานโค้ชมากโชกโชนมาวางแท็กติก มันจึงทำให้พวกเชาเล่นฟุตบอลอย่างมีระบบระเบียบแบบที่ทำให้ทุกคนต้องประหลาดใจ ตัวอย่างชัดเจนคือเกมในครึ่งแรกที่ศรีลังกา มีช่วงเวลาเพรสซิ่งสูงจนไทย ไม่อาจต่อบอลได้เลย แถมยังเปิดโอกาสให้ทีมช้างศึกได้ยิงเพียง 2 หน โดยหนึ่งในนั้นคือความผิดพลาดเพียงหนเดียวอันนำมาซึ่งประตูโทนของการแข่งขันนั่นเอง ต่อจากนี้ไป รับประกันเลยว่าทีมกองทัพทองจะไม่ใช่หมูในอวยอีกต่อไป',
//     'image': 'assets/images/image1.webp',
//   },
//   {
//     'title': 'เทรนต์ อาร์โนลด์ ลงตรงไหน?',
//     'seond': 'เทรนต์ อาร์โนลด์ ลงตรงไหน? ไลน์อัพ เรอัล มาดริด ซีซั่น2025/26',
//     'refer': 'ผู้เขียน siamsport',
//     'image': 'assets/images/image.png',
//   },
  
//   {
//     'title': 'ลิเวอร์พูล! ยุคเปลี่ยนคู่แบ็ก',
//     'seond': 'ส่องไลน์อัพใหม่ลิเวอร์พูล! ยุคเปลี่ยนคู่แบ็ก "เคอร์เคซ-ฟริมปง" เติมโหดสองฝั่ง',
//     'refer': 'ผู้เขียน siamsport',
//     'image': 'assets/images/image2.webp',
//   },
// ];
